beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_Timer.c
/* _OSTimerShift: Shifts the global Time variable. This is a value greater than 2^16. */
void _OSTimerShift(INT32 shiftTimeLimit)
{
  Time -= shiftTimeLimit;
} /* end of _OSTimerShift */


/* OSGetActualTime: Retrieve the current time. Combines the 16 bits of the timer counter
** with the global variable Time to yield the current time. */
INT32 OSGetActualTime(void)
{
  INT32 currentTime, tmp;
  do {
     currentTime = Time;
     tmp = currentTime | TIM_COUNTER;
  } while (currentTime != Time);
  return tmp;
} /* end of OSGetActualTime */


/* _TimerHandler: Catches STM-32 Timer interrupts and generates a software timer
** interrupt which is than carried out at a lower priority.
** Note: This function could have been written in assembler to reduce interrupt latencies. */
/* Claude Dans le cas du timer 1 ou 8, plusieurs vecteurs d'interruptions sont définit. Il
** devient préférable de les traiter de manière séparée. */
#if ZOTTAOS_TIMER == OS_IO_TIM1 || ZOTTAOS_TIMER == OS_IO_TIM8
   void TimerHandler_up(struct TIMER_ISR_DATA *descriptor)
   {
     TIM_COMPARATOR = 0;            // Disable timer comparator
     TIM_STATUS &= ~UPDATE_INT_BIT; // Clear interrupt flag
     Time += 0x10000;               // Increment most significant word of Time
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler_up */


   void TimerHandler_cc(struct TIMER_ISR_DATA *descriptor)
   {
     TIM_COMPARATOR = 0;                // Disable timer comparator
     TIM_STATUS &= ~COMPARATOR_INT_BIT; // Clear interrupt flag
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler_cc */
#else
   void TimerHandler(struct TIMER_ISR_DATA *descriptor)
   {
     TIM_COMPARATOR = 0; // Disable timer comparator
     /* Test interrupt source */
     if (TIM_STATUS & COMPARATOR_INT_BIT)  // Is comparator interrupt pending?
        TIM_STATUS &= ~COMPARATOR_INT_BIT; // Clear interrupt flag
     if (TIM_STATUS & UPDATE_INT_BIT) {    // Is timer overflow interrupt?
        TIM_STATUS &= ~UPDATE_INT_BIT;     // Clear interrupt flag
        #ifdef ZOTTAOS_TIMER_32
           Time += 0x40000000; // Increment most significant part of Time
        #elif defined(ZOTTAOS_TIMER_16)
           Time += 0x10000; // Increment most significant word of Time
        #endif
     }
     _OSGenerateSoftTimerInterrupt();
   } /* end of TimerHandler */
#endif


/* Claude */
/* _OSTimerSelectorHandler: à reprendre depuis le fichier d'en-tête. */
void _OSTimerSelectorHandler(struct TIMERSELECT *timerSelect)
{
  #define OFFSET_STATUS 0x10 // Offset to retrieve the interrupt flags bits register
  #define OFFSET_ENABLE 0x0C // Offset to retrieve the interrupt enable bits register
  TIMER_ISR_DATA *peripheralIODescriptor;
  /* Call the specific handler */
  /* Claude Le handler de la première source est appelé uniquement si la source correspond au vecteur, car
  ** la première source correspond tjs au Timer 1 ou 8 qui ont 4 vecteurs d'interruption chacun. */
  if (*(UINT32 *)(timerSelect->BaseRegisterTab[0] + OFFSET_STATUS) &
      *(UINT32 *)(timerSelect->BaseRegisterTab[0] + OFFSET_ENABLE) &
      timerSelect->InterruptBit) {
     peripheralIODescriptor = timerSelect->TimerISRTab[0];
     peripheralIODescriptor->TimerIntHandler(peripheralIODescriptor);
  }
  /* Claude Le handler de la seconde source est appelé quelque soit la source d'interruption, car
  ** les timer traité au seconde position on tjs un seul vecteur pour toute leurs sources. */
  if (*(UINT32 *)(timerSelect->BaseRegisterTab[1] + OFFSET_STATUS) &
      *(UINT32 *)(timerSelect->BaseRegisterTab[1] + OFFSET_ENABLE)) {
     peripheralIODescriptor = timerSelect->TimerISRTab[1];
     peripheralIODescriptor->TimerIntHandler(peripheralIODescriptor);
  }
} /* end of _OSTimerSelectorHandler */


/* Because the timer continues ticking, when we wish set a new value for the timer compa-
** rator, the difference in time between the new value and the previous must be such that
** when the assignment is done, the timer has not passed the comparator value. This is
** guaranteed by TIMER_OFFSET. */
/* The number of core cycles to considered in order to obtain TIMER_OFFSET are given in
** function _OSSetTimerComparator, and comprised between markers START_TIMER_OFFSET and
** END_TIMER_OFFSET. */
#define TIMER_OFFSET 5

/* _OSSetTimer: Sets the timer comparator to the next time event interval. This function
 * is called by the software timer interrupt handler when it finishes processing the cur-
 * rent interrupt and prepares its next interrupt. */
void _OSSetTimer(INT32 nextArrival)
{
#ifdef ZOTTAOS_TIMER_32
  do {
     OSUINT32_LL(&TIM_COMPARATOR);
     if (nextArrival - TIMER_OFFSET < TIM_COUNTER) {
        TIM_EVENT_GENERATION |= 2;
        break;
     }
  } while (!OSUINT32_SC(&TIM_COMPARATOR,nextArrival));
#elif defined(ZOTTAOS_TIMER_16)
  UINT16 time16;
  if ((nextArrival & 0xFFFF0000) == Time) {
     time16 = (UINT16)nextArrival;
     do {
        OSUINT16_LL(&TIM_COMPARATOR);
        if (time16 - TIMER_OFFSET < TIM_COUNTER) {
           TIM_EVENT_GENERATION |= 2;
           break;
        }
     } while (!OSUINT16_SC(&TIM_COMPARATOR,time16));
  }
#endif
} /* end of _OSSetTimer */
